---
kind: other
id: Methods.T:Autodesk.Revit.DB.ColumnAttachment
source: html/aad83176-1a53-af41-18b4-54f62c820af7.htm
---
# ColumnAttachment Methods

Attaches the column to the target. If an attachment already
 exists with the same "baseOrTop" value, no attachment is made.